import re

s1="18809090000是我的手机号，188开头的，以00结尾的：我的另一个手机号是15800887787， 两个QQ号分别是155998992 和 18809091293821,邮箱为python@163.com"

#正则表达式
print(re.findall(r"188.*",s1))# * 匹配任意字符
print(re.findall(r"188.?",s1))# ? 匹配0个或者1个（最多出现一次）
print(re.findall(r"188.+",s1))# + 匹配1个或者多个（至少出现一次）

print(re.findall(r"188\d{8}",s1)) # \d 匹配数字，{8} 匹配8个数字
print(re.findall(r"155\d{6,10}",s1))# {6,10} 匹配6-10个数字
print(re.findall(r"155\d{6,}",s1)) # {6,} 匹配6个或者更多个数字

print("-----------------------------------")

print(re.findall(r"1[38]\d{8}",s1)) # [38] 匹配3或者8
print(re.findall(r"1[^38]\d{8}",s1)) # [^38] 匹配除了3和8的字符
print(re.findall(r"1[3-9]\d{8}",s1)) # [3-9] 匹配3-9的字符
print(re.findall(r"^1[3-9]\d{9}",s1)) # ^ 匹配字符串的开头
print(re.findall(r"^1[3-9]\d{9}$",s1)) # $ 匹配字符串的结尾

print("===============================")

print(re.findall(r"\w+@\w+\.\w+",s1)) # \w 匹配任何单词字符（a-z、A-Z、0-9、_、其他语言字符）
print(re.findall(r"\w+@\w+\.\w+",s1,re.ASCII))# re.ASCII 匹配ASCII字符集(不包含其他语言字符)

print("++++++++++++++++++++++++++++++")
s2="现在的时间是2025-12-25 12:12:12，今天的天气还可以，气温是25度，明天天气会更冷，气温是23度"
print(re.findall(r"\d{4}-\d{2}-\d{2}",s2))
print(re.findall(r"(\d{4})-(\d{2})-(\d{2})",s2))


